# Используем базовый образ Ubuntu с последней версией
FROM ubuntu:latest

# Обновляем пакеты и устанавливаем несколько пакетов
RUN apt-get update && apt-get install -y \
# Устанавливаем X-приложения для графического вывода
x11-apps \
# Устанавливаем xauth для управления X-сервером
xauth \
# Удаляем кэш пакетов после установки
&& rm -rf /var//lib/apt/lists/*  

# Устанавливаем переменную среды DISPLAY в значение ":0", что позволяет приложениям
# внутри контейнера использовать X Window System для отображения графических интерфейсов.
ENV DISPLAY=:0

# Запускаем графическое приложение xeyes
CMD [ "xeyes" ]  